app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @post_images = @user.post_image.page(params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "post_images".* FROM "post_images" WHERE "post_images"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "post_images" WHERE "post_images"."user_id" = ?  [["user_id", 1]]

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2022-04-09 07:12:19.772965"], ["id", 1]]